app/Http/Controllers/FrontEndController.php

select * from `restorants` where REPLACE(subdomain, "-", "") = '18' and `restorants`.`deleted_at` is null
---
    public function subdomainMode()
    {
        $subDomain = $this->getSubDomain();
        if ($subDomain) {
            $restorant = Restorant::whereRaw('REPLACE(subdomain, "-", "") = ?', [str_replace("-","",$subDomain)])->get();

select * from `pages` where `showAsLink` = 1
---
                'plans' => $plans,
                'availableLanguages' => $availableLanguages,
                'locale' => $locale,
                'pages' => Pages::where('showAsLink', 1)->get(),